## Plan Result (sbox_mgmt - TerraformPlanApply)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-apl-ack-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-apl-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub.eventhub[&#34;evh-apl-pub-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules[&#34;evh-apl-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups[&#34;evh-apl-dl-dev-uks-dlrm-01&#34;]
  * module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups[&#34;evh-apl-pub-dev-uks-dlrm-01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-apl-ack-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apl-ack-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-apl-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apl-dl-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub.eventhub["evh-apl-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub" "eventhub" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apl-pub-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + partition_count     = 18
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-sbox"
      + status              = "Active"
    }

  # module.data_mgmt_zone.azurerm_eventhub_authorization_rule.eventhub_auth_rules["evh-apl-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "eventhub_auth_rules" {
      + eventhub_name                     = "evh-apl-dl-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "manager"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups["evh-apl-dl-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_consumer_group" "eventhub_consumer_groups" {
      + eventhub_name       = "evh-apl-dl-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "test"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # module.data_mgmt_zone.azurerm_eventhub_consumer_group.eventhub_consumer_groups["evh-apl-pub-dev-uks-dlrm-01"] will be created
  + resource "azurerm_eventhub_consumer_group" "eventhub_consumer_groups" {
      + eventhub_name       = "evh-apl-pub-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "preview_data_consumer_group"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":92,"Program":"tfcmt","SHA1":"","Target":"sbox_mgmt - TerraformPlanApply","Vars":{}} -->